---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir1WithSpacing
source: html/59a7dd05-735f-38ed-ba51-3520f815b19e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir1WithSpacing Property

"Top/Exterior Major"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryTopDir1WithSpacing { get; }
```